; domain
(define (domain zeno-travel)
(:requirements :typing :negative-preconditions)
(:types aircraft person city flevel - object)
(:predicates (at ?x - person  ?c - city )
             (at_aircraft ?x - aircraft ?c - city)
             (in ?p - person ?a - aircraft)
	         (fuel-level ?a - aircraft ?l - flevel)
	         (next ?l1 ?l2 - flevel))


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)

 :precondition (and (at ?p ?c)
                 (at_aircraft ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)))

(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)

 :precondition (and (in ?p ?a)
                 (at_aircraft ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)))

(:action fly
 :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 - flevel)

 :precondition (and (at_aircraft ?a ?c1)
                 (fuel-level ?a ?l1)
		 (next ?l2 ?l1))
 :effect (and (not (at_aircraft ?a ?c1))
              (at_aircraft ?a ?c2)
              (not (fuel-level ?a ?l1))
              (fuel-level ?a ?l2)))

(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 ?l3 - flevel)

 :precondition (and (at_aircraft ?a ?c1)
                 (fuel-level ?a ?l1)
		 (next ?l2 ?l1)
		 (next ?l3 ?l2)
		)
 :effect (and (not (at_aircraft ?a ?c1))
              (at_aircraft ?a ?c2)
              (not (fuel-level ?a ?l1))
              (fuel-level ?a ?l3)
	)
)

(:action refuel
 :parameters (?a - aircraft ?c - city ?l - flevel ?l1 - flevel)

 :precondition (and (fuel-level ?a ?l)
                 (next ?l ?l1)
                 (at_aircraft ?a ?c))
 :effect (and (fuel-level ?a ?l1) (not (fuel-level ?a ?l))))
)

; problem
(define (problem ZTRAVEL-5-50)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	person26 - person
	person27 - person
	person28 - person
	person29 - person
	person30 - person
	person31 - person
	person32 - person
	person33 - person
	person34 - person
	person35 - person
	person36 - person
	person37 - person
	person38 - person
	person39 - person
	person40 - person
	person41 - person
	person42 - person
	person43 - person
	person44 - person
	person45 - person
	person46 - person
	person47 - person
	person48 - person
	person49 - person
	person50 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at_aircraft plane1 city8)
	(fuel-level plane1 fl1)
	(at_aircraft plane2 city3)
	(fuel-level plane2 fl6)
	(at_aircraft plane3 city3)
	(fuel-level plane3 fl6)
	(at_aircraft plane4 city9)
	(fuel-level plane4 fl3)
	(at_aircraft plane5 city2)
	(fuel-level plane5 fl3)
	(at person1 city1)
	(at person2 city5)
	(at person3 city0)
	(at person4 city9)
	(at person5 city7)
	(at person6 city0)
	(at person7 city7)
	(at person8 city2)
	(at person9 city9)
	(at person10 city2)
	(at person11 city6)
	(at person12 city4)
	(at person13 city0)
	(at person14 city3)
	(at person15 city9)
	(at person16 city8)
	(at person17 city4)
	(at person18 city4)
	(at person19 city5)
	(at person20 city0)
	(at person21 city0)
	(at person22 city0)
	(at person23 city5)
	(at person24 city5)
	(at person25 city3)
	(at person26 city7)
	(at person27 city2)
	(at person28 city1)
	(at person29 city9)
	(at person30 city6)
	(at person31 city9)
	(at person32 city2)
	(at person33 city9)
	(at person34 city0)
	(at person35 city5)
	(at person36 city2)
	(at person37 city0)
	(at person38 city8)
	(at person39 city7)
	(at person40 city7)
	(at person41 city1)
	(at person42 city4)
	(at person43 city2)
	(at person44 city5)
	(at person45 city5)
	(at person46 city3)
	(at person47 city7)
	(at person48 city1)
	(at person49 city9)
	(at person50 city8)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at person1 city0)
	(at person2 city4)
	(at person3 city6)
	(at person4 city7)
	(at person5 city5)
	(at person6 city1)
	(at person7 city4)
	(at person8 city9)
	(at person9 city7)
	(at person12 city4)
	(at person13 city4)
	(at person14 city4)
	(at person15 city1)
	(at person16 city1)
	(at person17 city8)
	(at person18 city1)
	(at person19 city1)
	(at person20 city3)
	(at person21 city0)
	(at person22 city4)
	(at person23 city4)
	(at person24 city8)
	(at person25 city7)
	(at person26 city5)
	(at person27 city0)
	(at person28 city4)
	(at person30 city0)
	(at person31 city0)
	(at person32 city1)
	(at person33 city6)
	(at person34 city2)
	(at person35 city5)
	(at person36 city3)
	(at person37 city5)
	(at person38 city7)
	(at person39 city6)
	(at person40 city2)
	(at person42 city5)
	(at person43 city4)
	(at person44 city4)
	(at person45 city0)
	(at person46 city2)
	(at person47 city3)
	(at person48 city1)
	(at person49 city8)
	(at person50 city6)
	))

)

; plan
1. (fly plane5 city2 city3 fl3 fl2)
   deleted: (at_aircraft plane5 city2) (fuel-level plane5 fl3)
   added: (at_aircraft plane5 city3) (fuel-level plane5 fl2)
   goals met: 4 of 46
2. (board person46 plane5 city3)
   deleted: (at person46 city3)
   added: (in person46 plane5)
   goals met: 4 of 46
3. (board person25 plane5 city3)
   deleted: (at person25 city3)
   added: (in person25 plane5)
   goals met: 4 of 46
4. (board person14 plane5 city3)
   deleted: (at person14 city3)
   added: (in person14 plane5)
   goals met: 4 of 46
5. (fly plane4 city9 city2 fl3 fl2)
   deleted: (at_aircraft plane4 city9) (fuel-level plane4 fl3)
   added: (at_aircraft plane4 city2) (fuel-level plane4 fl2)
   goals met: 4 of 46
6. (fly plane5 city3 city2 fl2 fl1)
   deleted: (at_aircraft plane5 city3) (fuel-level plane5 fl2)
   added: (at_aircraft plane5 city2) (fuel-level plane5 fl1)
   goals met: 4 of 46
7. (board person8 plane5 city2)
   deleted: (at person8 city2)
   added: (in person8 plane5)
   goals met: 4 of 46
8. (debark person46 plane5 city2)
   deleted: (in person46 plane5)
   added: (at person46 city2)
   goals met: 5 of 46
9. (board person43 plane5 city2)
   deleted: (at person43 city2)
   added: (in person43 plane5)
   goals met: 5 of 46
10. (fly plane5 city2 city4 fl1 fl0)
   deleted: (at_aircraft plane5 city2) (fuel-level plane5 fl1)
   added: (at_aircraft plane5 city4) (fuel-level plane5 fl0)
   goals met: 5 of 46
11. (debark person43 plane5 city4)
   deleted: (in person43 plane5)
   added: (at person43 city4)
   goals met: 6 of 46
12. (debark person14 plane5 city4)
   deleted: (in person14 plane5)
   added: (at person14 city4)
   goals met: 7 of 46
13. (fly plane4 city2 city3 fl2 fl1)
   deleted: (at_aircraft plane4 city2) (fuel-level plane4 fl2)
   added: (at_aircraft plane4 city3) (fuel-level plane4 fl1)
   goals met: 7 of 46
14. (board person50 plane1 city8)
   deleted: (at person50 city8)
   added: (in person50 plane1)
   goals met: 7 of 46
15. (fly plane1 city8 city6 fl1 fl0)
   deleted: (at_aircraft plane1 city8) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city6) (fuel-level plane1 fl0)
   goals met: 7 of 46
16. (debark person50 plane1 city6)
   deleted: (in person50 plane1)
   added: (at person50 city6)
   goals met: 8 of 46
17. (refuel plane5 city4 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 8 of 46
18. (fly plane5 city4 city7 fl1 fl0)
   deleted: (at_aircraft plane5 city4) (fuel-level plane5 fl1)
   added: (at_aircraft plane5 city7) (fuel-level plane5 fl0)
   goals met: 8 of 46
19. (debark person25 plane5 city7)
   deleted: (in person25 plane5)
   added: (at person25 city7)
   goals met: 9 of 46
20. (refuel plane5 city7 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 9 of 46
21. (fly plane5 city7 city9 fl1 fl0)
   deleted: (at_aircraft plane5 city7) (fuel-level plane5 fl1)
   added: (at_aircraft plane5 city9) (fuel-level plane5 fl0)
   goals met: 9 of 46
22. (debark person8 plane5 city9)
   deleted: (in person8 plane5)
   added: (at person8 city9)
   goals met: 10 of 46
23. (fly plane2 city3 city0 fl6 fl5)
   deleted: (at_aircraft plane2 city3) (fuel-level plane2 fl6)
   added: (at_aircraft plane2 city0) (fuel-level plane2 fl5)
   goals met: 10 of 46
24. (board person6 plane2 city0)
   deleted: (at person6 city0)
   added: (in person6 plane2)
   goals met: 10 of 46
25. (board person37 plane2 city0)
   deleted: (at person37 city0)
   added: (in person37 plane2)
   goals met: 10 of 46
26. (board person34 plane2 city0)
   deleted: (at person34 city0)
   added: (in person34 plane2)
   goals met: 10 of 46
27. (board person3 plane2 city0)
   deleted: (at person3 city0)
   added: (in person3 plane2)
   goals met: 10 of 46
28. (board person22 plane2 city0)
   deleted: (at person22 city0)
   added: (in person22 plane2)
   goals met: 10 of 46
29. (board person20 plane2 city0)
   deleted: (at person20 city0)
   added: (in person20 plane2)
   goals met: 10 of 46
30. (board person13 plane2 city0)
   deleted: (at person13 city0)
   added: (in person13 plane2)
   goals met: 10 of 46
31. (fly plane2 city0 city3 fl5 fl4)
   deleted: (at_aircraft plane2 city0) (fuel-level plane2 fl5)
   added: (at_aircraft plane2 city3) (fuel-level plane2 fl4)
   goals met: 10 of 46
32. (debark person20 plane2 city3)
   deleted: (in person20 plane2)
   added: (at person20 city3)
   goals met: 11 of 46
33. (fly plane2 city3 city6 fl4 fl3)
   deleted: (at_aircraft plane2 city3) (fuel-level plane2 fl4)
   added: (at_aircraft plane2 city6) (fuel-level plane2 fl3)
   goals met: 11 of 46
34. (board person30 plane2 city6)
   deleted: (at person30 city6)
   added: (in person30 plane2)
   goals met: 11 of 46
35. (debark person3 plane2 city6)
   deleted: (in person3 plane2)
   added: (at person3 city6)
   goals met: 12 of 46
36. (fly plane2 city6 city0 fl3 fl2)
   deleted: (at_aircraft plane2 city6) (fuel-level plane2 fl3)
   added: (at_aircraft plane2 city0) (fuel-level plane2 fl2)
   goals met: 12 of 46
37. (debark person30 plane2 city0)
   deleted: (in person30 plane2)
   added: (at person30 city0)
   goals met: 13 of 46
38. (fly plane2 city0 city1 fl2 fl1)
   deleted: (at_aircraft plane2 city0) (fuel-level plane2 fl2)
   added: (at_aircraft plane2 city1) (fuel-level plane2 fl1)
   goals met: 13 of 46
39. (debark person6 plane2 city1)
   deleted: (in person6 plane2)
   added: (at person6 city1)
   goals met: 14 of 46
40. (fly plane2 city1 city2 fl1 fl0)
   deleted: (at_aircraft plane2 city1) (fuel-level plane2 fl1)
   added: (at_aircraft plane2 city2) (fuel-level plane2 fl0)
   goals met: 14 of 46
41. (debark person34 plane2 city2)
   deleted: (in person34 plane2)
   added: (at person34 city2)
   goals met: 15 of 46
42. (refuel plane2 city2 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 15 of 46
43. (board person36 plane2 city2)
   deleted: (at person36 city2)
   added: (in person36 plane2)
   goals met: 15 of 46
44. (fly plane2 city2 city3 fl1 fl0)
   deleted: (at_aircraft plane2 city2) (fuel-level plane2 fl1)
   added: (at_aircraft plane2 city3) (fuel-level plane2 fl0)
   goals met: 15 of 46
45. (refuel plane2 city3 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 15 of 46
46. (debark person36 plane2 city3)
   deleted: (in person36 plane2)
   added: (at person36 city3)
   goals met: 16 of 46
47. (fly plane2 city3 city4 fl1 fl0)
   deleted: (at_aircraft plane2 city3) (fuel-level plane2 fl1)
   added: (at_aircraft plane2 city4) (fuel-level plane2 fl0)
   goals met: 16 of 46
48. (debark person22 plane2 city4)
   deleted: (in person22 plane2)
   added: (at person22 city4)
   goals met: 17 of 46
49. (refuel plane2 city4 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 17 of 46
50. (board person42 plane2 city4)
   deleted: (at person42 city4)
   added: (in person42 plane2)
   goals met: 17 of 46
51. (board person18 plane2 city4)
   deleted: (at person18 city4)
   added: (in person18 plane2)
   goals met: 17 of 46
52. (board person17 plane2 city4)
   deleted: (at person17 city4)
   added: (in person17 plane2)
   goals met: 17 of 46
53. (debark person13 plane2 city4)
   deleted: (in person13 plane2)
   added: (at person13 city4)
   goals met: 18 of 46
54. (fly plane2 city4 city8 fl1 fl0)
   deleted: (at_aircraft plane2 city4) (fuel-level plane2 fl1)
   added: (at_aircraft plane2 city8) (fuel-level plane2 fl0)
   goals met: 18 of 46
55. (fly plane3 city3 city7 fl6 fl5)
   deleted: (at_aircraft plane3 city3) (fuel-level plane3 fl6)
   added: (at_aircraft plane3 city7) (fuel-level plane3 fl5)
   goals met: 18 of 46
56. (board person7 plane3 city7)
   deleted: (at person7 city7)
   added: (in person7 plane3)
   goals met: 18 of 46
57. (board person5 plane3 city7)
   deleted: (at person5 city7)
   added: (in person5 plane3)
   goals met: 18 of 46
58. (board person47 plane3 city7)
   deleted: (at person47 city7)
   added: (in person47 plane3)
   goals met: 18 of 46
59. (board person40 plane3 city7)
   deleted: (at person40 city7)
   added: (in person40 plane3)
   goals met: 18 of 46
60. (board person39 plane3 city7)
   deleted: (at person39 city7)
   added: (in person39 plane3)
   goals met: 18 of 46
61. (board person26 plane3 city7)
   deleted: (at person26 city7)
   added: (in person26 plane3)
   goals met: 18 of 46
62. (debark person17 plane2 city8)
   deleted: (in person17 plane2)
   added: (at person17 city8)
   goals met: 19 of 46
63. (board person16 plane2 city8)
   deleted: (at person16 city8)
   added: (in person16 plane2)
   goals met: 19 of 46
64. (fly plane3 city7 city8 fl5 fl4)
   deleted: (at_aircraft plane3 city7) (fuel-level plane3 fl5)
   added: (at_aircraft plane3 city8) (fuel-level plane3 fl4)
   goals met: 19 of 46
65. (board person38 plane3 city8)
   deleted: (at person38 city8)
   added: (in person38 plane3)
   goals met: 19 of 46
66. (fly plane3 city8 city1 fl4 fl3)
   deleted: (at_aircraft plane3 city8) (fuel-level plane3 fl4)
   added: (at_aircraft plane3 city1) (fuel-level plane3 fl3)
   goals met: 19 of 46
67. (board person28 plane3 city1)
   deleted: (at person28 city1)
   added: (in person28 plane3)
   goals met: 19 of 46
68. (board person1 plane3 city1)
   deleted: (at person1 city1)
   added: (in person1 plane3)
   goals met: 19 of 46
69. (fly plane3 city1 city0 fl3 fl2)
   deleted: (at_aircraft plane3 city1) (fuel-level plane3 fl3)
   added: (at_aircraft plane3 city0) (fuel-level plane3 fl2)
   goals met: 19 of 46
70. (debark person1 plane3 city0)
   deleted: (in person1 plane3)
   added: (at person1 city0)
   goals met: 20 of 46
71. (fly plane3 city0 city2 fl2 fl1)
   deleted: (at_aircraft plane3 city0) (fuel-level plane3 fl2)
   added: (at_aircraft plane3 city2) (fuel-level plane3 fl1)
   goals met: 20 of 46
72. (debark person40 plane3 city2)
   deleted: (in person40 plane3)
   added: (at person40 city2)
   goals met: 21 of 46
73. (board person32 plane3 city2)
   deleted: (at person32 city2)
   added: (in person32 plane3)
   goals met: 21 of 46
74. (board person27 plane3 city2)
   deleted: (at person27 city2)
   added: (in person27 plane3)
   goals met: 21 of 46
75. (refuel plane2 city8 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 21 of 46
76. (fly plane2 city8 city1 fl1 fl0)
   deleted: (at_aircraft plane2 city8) (fuel-level plane2 fl1)
   added: (at_aircraft plane2 city1) (fuel-level plane2 fl0)
   goals met: 21 of 46
77. (debark person18 plane2 city1)
   deleted: (in person18 plane2)
   added: (at person18 city1)
   goals met: 22 of 46
78. (debark person16 plane2 city1)
   deleted: (in person16 plane2)
   added: (at person16 city1)
   goals met: 23 of 46
79. (fly plane3 city2 city0 fl1 fl0)
   deleted: (at_aircraft plane3 city2) (fuel-level plane3 fl1)
   added: (at_aircraft plane3 city0) (fuel-level plane3 fl0)
   goals met: 23 of 46
80. (refuel plane3 city0 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 23 of 46
81. (debark person27 plane3 city0)
   deleted: (in person27 plane3)
   added: (at person27 city0)
   goals met: 24 of 46
82. (fly plane3 city0 city1 fl1 fl0)
   deleted: (at_aircraft plane3 city0) (fuel-level plane3 fl1)
   added: (at_aircraft plane3 city1) (fuel-level plane3 fl0)
   goals met: 24 of 46
83. (refuel plane3 city1 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 24 of 46
84. (debark person32 plane3 city1)
   deleted: (in person32 plane3)
   added: (at person32 city1)
   goals met: 25 of 46
85. (fly plane3 city1 city3 fl1 fl0)
   deleted: (at_aircraft plane3 city1) (fuel-level plane3 fl1)
   added: (at_aircraft plane3 city3) (fuel-level plane3 fl0)
   goals met: 25 of 46
86. (debark person47 plane3 city3)
   deleted: (in person47 plane3)
   added: (at person47 city3)
   goals met: 26 of 46
87. (refuel plane3 city3 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 26 of 46
88. (fly plane3 city3 city4 fl1 fl0)
   deleted: (at_aircraft plane3 city3) (fuel-level plane3 fl1)
   added: (at_aircraft plane3 city4) (fuel-level plane3 fl0)
   goals met: 26 of 46
89. (refuel plane3 city4 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 26 of 46
90. (debark person7 plane3 city4)
   deleted: (in person7 plane3)
   added: (at person7 city4)
   goals met: 27 of 46
91. (debark person28 plane3 city4)
   deleted: (in person28 plane3)
   added: (at person28 city4)
   goals met: 28 of 46
92. (fly plane3 city4 city5 fl1 fl0)
   deleted: (at_aircraft plane3 city4) (fuel-level plane3 fl1)
   added: (at_aircraft plane3 city5) (fuel-level plane3 fl0)
   goals met: 28 of 46
93. (debark person5 plane3 city5)
   deleted: (in person5 plane3)
   added: (at person5 city5)
   goals met: 29 of 46
94. (refuel plane3 city5 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 29 of 46
95. (board person45 plane3 city5)
   deleted: (at person45 city5)
   added: (in person45 plane3)
   goals met: 29 of 46
96. (board person44 plane3 city5)
   deleted: (at person44 city5)
   added: (in person44 plane3)
   goals met: 29 of 46
97. (debark person26 plane3 city5)
   deleted: (in person26 plane3)
   added: (at person26 city5)
   goals met: 30 of 46
98. (board person24 plane3 city5)
   deleted: (at person24 city5)
   added: (in person24 plane3)
   goals met: 30 of 46
99. (board person23 plane3 city5)
   deleted: (at person23 city5)
   added: (in person23 plane3)
   goals met: 30 of 46
100. (board person2 plane3 city5)
   deleted: (at person2 city5)
   added: (in person2 plane3)
   goals met: 30 of 46
101. (board person19 plane3 city5)
   deleted: (at person19 city5)
   added: (in person19 plane3)
   goals met: 30 of 46
102. (fly plane3 city5 city9 fl1 fl0)
   deleted: (at_aircraft plane3 city5) (fuel-level plane3 fl1)
   added: (at_aircraft plane3 city9) (fuel-level plane3 fl0)
   goals met: 30 of 46
103. (refuel plane3 city9 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 30 of 46
104. (board person9 plane3 city9)
   deleted: (at person9 city9)
   added: (in person9 plane3)
   goals met: 30 of 46
105. (board person49 plane3 city9)
   deleted: (at person49 city9)
   added: (in person49 plane3)
   goals met: 30 of 46
106. (board person4 plane3 city9)
   deleted: (at person4 city9)
   added: (in person4 plane3)
   goals met: 30 of 46
107. (board person33 plane3 city9)
   deleted: (at person33 city9)
   added: (in person33 plane3)
   goals met: 30 of 46
108. (board person31 plane3 city9)
   deleted: (at person31 city9)
   added: (in person31 plane3)
   goals met: 30 of 46
109. (board person15 plane3 city9)
   deleted: (at person15 city9)
   added: (in person15 plane3)
   goals met: 30 of 46
110. (refuel plane2 city1 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 30 of 46
111. (fly plane2 city1 city5 fl1 fl0)
   deleted: (at_aircraft plane2 city1) (fuel-level plane2 fl1)
   added: (at_aircraft plane2 city5) (fuel-level plane2 fl0)
   goals met: 30 of 46
112. (debark person42 plane2 city5)
   deleted: (in person42 plane2)
   added: (at person42 city5)
   goals met: 31 of 46
113. (debark person37 plane2 city5)
   deleted: (in person37 plane2)
   added: (at person37 city5)
   goals met: 32 of 46
114. (fly plane3 city9 city0 fl1 fl0)
   deleted: (at_aircraft plane3 city9) (fuel-level plane3 fl1)
   added: (at_aircraft plane3 city0) (fuel-level plane3 fl0)
   goals met: 32 of 46
115. (debark person45 plane3 city0)
   deleted: (in person45 plane3)
   added: (at person45 city0)
   goals met: 33 of 46
116. (debark person31 plane3 city0)
   deleted: (in person31 plane3)
   added: (at person31 city0)
   goals met: 34 of 46
117. (refuel plane3 city0 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 34 of 46
118. (fly plane3 city0 city1 fl1 fl0)
   deleted: (at_aircraft plane3 city0) (fuel-level plane3 fl1)
   added: (at_aircraft plane3 city1) (fuel-level plane3 fl0)
   goals met: 34 of 46
119. (debark person19 plane3 city1)
   deleted: (in person19 plane3)
   added: (at person19 city1)
   goals met: 35 of 46
120. (debark person15 plane3 city1)
   deleted: (in person15 plane3)
   added: (at person15 city1)
   goals met: 36 of 46
121. (refuel plane3 city1 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 36 of 46
122. (fly plane3 city1 city4 fl1 fl0)
   deleted: (at_aircraft plane3 city1) (fuel-level plane3 fl1)
   added: (at_aircraft plane3 city4) (fuel-level plane3 fl0)
   goals met: 36 of 46
123. (debark person44 plane3 city4)
   deleted: (in person44 plane3)
   added: (at person44 city4)
   goals met: 37 of 46
124. (debark person23 plane3 city4)
   deleted: (in person23 plane3)
   added: (at person23 city4)
   goals met: 38 of 46
125. (debark person2 plane3 city4)
   deleted: (in person2 plane3)
   added: (at person2 city4)
   goals met: 39 of 46
126. (refuel plane3 city4 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 39 of 46
127. (fly plane3 city4 city6 fl1 fl0)
   deleted: (at_aircraft plane3 city4) (fuel-level plane3 fl1)
   added: (at_aircraft plane3 city6) (fuel-level plane3 fl0)
   goals met: 39 of 46
128. (debark person39 plane3 city6)
   deleted: (in person39 plane3)
   added: (at person39 city6)
   goals met: 40 of 46
129. (debark person33 plane3 city6)
   deleted: (in person33 plane3)
   added: (at person33 city6)
   goals met: 41 of 46
130. (refuel plane3 city6 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 41 of 46
131. (fly plane3 city6 city7 fl1 fl0)
   deleted: (at_aircraft plane3 city6) (fuel-level plane3 fl1)
   added: (at_aircraft plane3 city7) (fuel-level plane3 fl0)
   goals met: 41 of 46
132. (refuel plane3 city7 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 41 of 46
133. (debark person9 plane3 city7)
   deleted: (in person9 plane3)
   added: (at person9 city7)
   goals met: 42 of 46
134. (debark person4 plane3 city7)
   deleted: (in person4 plane3)
   added: (at person4 city7)
   goals met: 43 of 46
135. (debark person38 plane3 city7)
   deleted: (in person38 plane3)
   added: (at person38 city7)
   goals met: 44 of 46
136. (fly plane3 city7 city8 fl1 fl0)
   deleted: (at_aircraft plane3 city7) (fuel-level plane3 fl1)
   added: (at_aircraft plane3 city8) (fuel-level plane3 fl0)
   goals met: 44 of 46
137. (debark person49 plane3 city8)
   deleted: (in person49 plane3)
   added: (at person49 city8)
   goals met: 45 of 46
138. (debark person24 plane3 city8)
   deleted: (in person24 plane3)
   added: (at person24 city8)
   goals met: 46 of 46
